 
/* -------防止递归包含的定义-----------------------------------------------------------------------*/
#ifndef __SPI_H
#define __SPI_H
/*--------包含头文件------------------------------------------------------------------------------*/
#include "stm32f4xx.h" 
/*---------------------出口函数模型---------------------------------------------------------------*/ 						  	    													  
void SPI1_Init(void);			 //初始化SPI1口 
void SPI1_SetSpeed(uint8_t SPI_BaudRatePrescaler);
uint8_t SPI1_ReadWriteByte(uint8_t TxData);//SPI1总线读写一个字节
		 
#endif

